Infineon/ArduinoCore-zephyr/boards.txt

##########################################################################################

# NOTE:
#
# The following board-specific properties are auto-generated by 'build.sh'
# and saved in 'boards.local.txt'. VALUES IN THIS FILE WILL HAVE NO EFFECT.
#
# - build.architecture
# - build.float-abi
# - build.fpu
# - build.mcu
# - upload.address
# - upload.maximum_data_size
# - upload.maximum_size

##########################################################################################

menu.debug=Debug
menu.link_mode=Link mode
menu.wait_linux_boot=Startup mode

##########################################################################################

giga.name=Arduino Giga R1
giga.build.core=arduino
giga.build.crossprefix=arm-zephyr-eabi-
giga.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

giga.menu.debug.false=Standard
giga.menu.debug.true=Debug
giga.menu.debug.true.build.zsk_args.debug=-debug

giga.menu.link_mode.dynamic=Dynamic
giga.menu.link_mode.static=Static
giga.menu.link_mode.static.build.link_mode=static
giga.menu.link_mode.static.upload.extension=bin-zsk.bin

giga.build.zephyr_target=arduino_giga_r1//m7
giga.build.zephyr_args=--shield arduino_giga_display_shield
giga.build.zephyr_hals=hal_stm32 hal_infineon
giga.build.zephyr_toolchain=arm-zephyr-eabi
giga.build.variant=arduino_giga_r1_stm32h747xx_m7
giga.build.artifact=zephyr_main

giga.build.extra_flags=
giga.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
giga.build.board=GIGA
giga.upload_port.0.vid=0x2341
giga.upload_port.0.pid=0x0666

giga.upload.tool=dfu-util
giga.upload.tool.default=dfu-util
giga.upload.protocol=
giga.upload.transport=
giga.upload.interface=0
giga.upload.use_1200bps_touch=true
giga.upload.wait_for_upload_port=true
giga.upload.native_usb=true

giga.bootloader.tool=dfu-util
giga.bootloader.tool.default=dfu-util
giga.bootloader.pid=0x0366
giga.bootloader.interface=0
giga.bootloader.file=zephyr-{build.variant}.bin
giga.bootloader.address=0x08040000

giga.debug.tool=gdb
giga.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
giga.debug.server.openocd.scripts.1={programmer.transport_script}
giga.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
giga.debug.cortex-debug.custom.request=attach
giga.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##########################################################################################

nano33ble.name=Arduino Nano 33 BLE
nano33ble.build.core=arduino
nano33ble.build.crossprefix=arm-zephyr-eabi-
nano33ble.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nano33ble.menu.debug.false=Standard
nano33ble.menu.debug.true=Debug
nano33ble.menu.debug.true.build.zsk_args.debug=-debug

nano33ble.menu.link_mode.dynamic=Dynamic
nano33ble.menu.link_mode.static=Static
nano33ble.menu.link_mode.static.build.link_mode=static
nano33ble.menu.link_mode.static.upload.extension=bin-zsk.bin

nano33ble.build.zephyr_target=arduino_nano_33_ble//sense
nano33ble.build.zephyr_args=
nano33ble.build.zephyr_hals=hal_nordic
nano33ble.build.zephyr_toolchain=arm-zephyr-eabi
nano33ble.build.artifact=zephyr_main
nano33ble.build.variant=arduino_nano_33_ble_nrf52840_sense

nano33ble.build.extra_flags=
nano33ble.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano33ble.build.board=NANO33BLE
nano33ble.upload_port.0.vid=0x2341
nano33ble.upload_port.0.pid=0x065a

nano33ble.upload.tool=bossac
nano33ble.upload.tool.default=bossac
nano33ble.upload.protocol=
nano33ble.upload.transport=
nano33ble.upload.use_1200bps_touch=true
nano33ble.upload.wait_for_upload_port=true
nano33ble.upload.native_usb=true
nano33ble.upload.offset=0x10000 # bootloader skips its own partition

nano33ble.bootloader.tool=bossac
nano33ble.bootloader.tool.default=bossac
nano33ble.bootloader.file=zephyr-{build.variant}.bin
nano33ble.bootloader.address=0x0000

nano33ble.debug.tool=gdb
nano33ble.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nano33ble.debug.server.openocd.scripts.1={programmer.transport_script}
nano33ble.debug.server.openocd.scripts.2=target/nrf52.cfg
nano33ble.debug.cortex-debug.custom.request=attach

##############################################################################################################

##############################################################################################################

##########################################################################################

portentah7.name=Arduino Portenta H7
portentah7.build.core=arduino
portentah7.build.crossprefix=arm-zephyr-eabi-
portentah7.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

portentah7.menu.debug.false=Standard
portentah7.menu.debug.true=Debug
portentah7.menu.debug.true.build.zsk_args.debug=-debug

portentah7.menu.link_mode.dynamic=Dynamic
portentah7.menu.link_mode.static=Static
portentah7.menu.link_mode.static.build.link_mode=static
portentah7.menu.link_mode.static.upload.extension=bin-zsk.bin

portentah7.build.zephyr_target=arduino_portenta_h7@1.0.0//m7
portentah7.build.zephyr_args=
portentah7.build.zephyr_hals=hal_stm32 hal_infineon
portentah7.build.zephyr_toolchain=arm-zephyr-eabi
portentah7.build.artifact=zephyr_main
portentah7.build.variant=arduino_portenta_h7_stm32h747xx_m7

portentah7.build.extra_flags=
portentah7.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentah7.build.board=PORTENTA_H7_M7
portentah7.upload_port.0.vid=0x2341
portentah7.upload_port.0.pid=0x065b

portentah7.upload.tool=dfu-util
portentah7.upload.tool.default=dfu-util
portentah7.upload.protocol=
portentah7.upload.transport=
portentah7.upload.interface=0
portentah7.upload.use_1200bps_touch=true
portentah7.upload.wait_for_upload_port=true
portentah7.upload.native_usb=true

portentah7.bootloader.tool=dfu-util
portentah7.bootloader.tool.default=dfu-util
portentah7.bootloader.pid=0x035b
portentah7.bootloader.interface=0
portentah7.bootloader.file=zephyr-{build.variant}.bin
portentah7.bootloader.address=0x08040000

portentah7.debug.tool=gdb
portentah7.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
portentah7.debug.server.openocd.scripts.1={programmer.transport_script}
portentah7.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
portentah7.debug.cortex-debug.custom.request=attach
portentah7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##############################################################################################################

nicla_vision.name=Arduino Nicla Vision
nicla_vision.build.core=arduino
nicla_vision.build.crossprefix=arm-zephyr-eabi-
nicla_vision.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nicla_vision.menu.debug.false=Standard
nicla_vision.menu.debug.true=Debug
nicla_vision.menu.debug.true.build.zsk_args.debug=-debug

nicla_vision.menu.link_mode.dynamic=Dynamic
nicla_vision.menu.link_mode.static=Static
nicla_vision.menu.link_mode.static.build.link_mode=static
nicla_vision.menu.link_mode.static.upload.extension=bin-zsk.bin

nicla_vision.build.zephyr_target=arduino_nicla_vision//m7
nicla_vision.build.zephyr_args=
nicla_vision.build.zephyr_hals=hal_stm32 hal_infineon
nicla_vision.build.zephyr_toolchain=arm-zephyr-eabi
nicla_vision.build.artifact=zephyr_main
nicla_vision.build.variant=arduino_nicla_vision_stm32h747xx_m7

nicla_vision.build.extra_flags=
nicla_vision.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nicla_vision.build.board=NICLA_VISION
nicla_vision.upload_port.0.vid=0x2341
nicla_vision.upload_port.0.pid=0x065f

nicla_vision.upload.tool=dfu-util
nicla_vision.upload.tool.default=dfu-util
nicla_vision.upload.protocol=
nicla_vision.upload.transport=
nicla_vision.upload.interface=0
nicla_vision.upload.use_1200bps_touch=true
nicla_vision.upload.wait_for_upload_port=true
nicla_vision.upload.native_usb=true

nicla_vision.bootloader.tool=dfu-util
nicla_vision.bootloader.tool.default=dfu-util
nicla_vision.bootloader.pid=0x035f
nicla_vision.bootloader.interface=0
nicla_vision.bootloader.file=zephyr-{build.variant}.bin
nicla_vision.bootloader.address=0x08040000

