Infineon/ArduinoCore-zephyr/boards.txt
nicla_vision.debug.tool=gdb
nicla_vision.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nicla_vision.debug.server.openocd.scripts.1={programmer.transport_script}
nicla_vision.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
nicla_vision.debug.cortex-debug.custom.request=attach
nicla_vision.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##############################################################################################################

##########################################################################################

nicla_sense.name=Arduino Nicla Sense ME
nicla_sense.build.core=arduino
nicla_sense.build.crossprefix=arm-zephyr-eabi-
nicla_sense.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nicla_sense.menu.link_mode.dynamic=Dynamic
nicla_sense.menu.link_mode.static=Static
nicla_sense.menu.link_mode.static.build.link_mode=static
nicla_sense.menu.link_mode.static.upload.extension=bin-zsk.bin

nicla_sense.build.zephyr_target=arduino_nicla_sense_me
nicla_sense.build.zephyr_args=
nicla_sense.build.zephyr_hals=hal_nordic
nicla_sense.build.zephyr_toolchain=arm-zephyr-eabi
nicla_sense.build.artifact=zephyr_main
nicla_sense.build.variant=arduino_nicla_sense_me_nrf52832

nicla_sense.openocd_cfg=flash_sketch.cfg
nicla_sense.build.extra_flags=
nicla_sense.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nicla_sense.build.board=NICLA_SENSE_ME
nicla_sense.upload_port.0.vid=0x2341
nicla_sense.upload_port.0.pid=0x0060

nicla_sense.upload.tool=openocd
nicla_sense.upload.tool.default=openocd
nicla_sense.upload.protocol=
nicla_sense.upload.config=-f target/nrf52.cfg
nicla_sense.upload.programmer=-f interface/cmsis-dap.cfg
nicla_sense.upload.use_1200bps_touch=false
nicla_sense.upload.wait_for_upload_port=false
nicla_sense.upload.native_usb=false
nicla_sense.upload.target=nrf52

nicla_sense.bootloader.tool=openocd
nicla_sense.bootloader.tool.default=openocd
nicla_sense.bootloader.file=zephyr-{build.variant}.hex
nicla_sense.bootloader.target=nrf52

nicla_sense.debug.tool=gdb
nicla_sense.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nicla_sense.debug.server.openocd.scripts.1={programmer.transport_script}
nicla_sense.debug.server.openocd.scripts.2=target/nrf52.cfg
nicla_sense.debug.cortex-debug.custom.request=attach

##########################################################################################

portentac33.name=Arduino Portenta C33
portentac33.build.core=arduino
portentac33.build.crossprefix=arm-zephyr-eabi-
portentac33.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

portentac33.menu.debug.false=Standard
portentac33.menu.debug.true=Debug
portentac33.menu.debug.true.build.zsk_args.debug=-debug

portentac33.menu.link_mode.dynamic=Dynamic
portentac33.menu.link_mode.static=Static
portentac33.menu.link_mode.static.build.link_mode=static
portentac33.menu.link_mode.static.upload.extension=bin-zsk.bin

portentac33.build.zephyr_target=arduino_portenta_c33
portentac33.build.zephyr_args=
portentac33.build.zephyr_hals=hal_renesas nanopb
portentac33.build.zephyr_toolchain=arm-zephyr-eabi
portentac33.build.artifact=zephyr_main
portentac33.build.variant=arduino_portenta_c33_r7fa6m5bh3cfc

portentac33.build.extra_flags=
portentac33.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentac33.build.board=PORTENTA_C33
portentac33.upload_port.0.vid=0x2341
portentac33.upload_port.0.pid=0x0668
portentac33.upload.target=portentac33

portentac33.upload.tool=dfu-util
portentac33.upload.tool.default=dfu-util
portentac33.upload.protocol=
portentac33.upload.transport=
portentac33.upload.interface=1
portentac33.upload.use_1200bps_touch=true
portentac33.upload.wait_for_upload_port=false
portentac33.upload.native_usb=true
portentac33.upload.dfuse=

portentac33.bootloader.tool=dfu-util
portentac33.bootloader.tool.default=dfu-util
portentac33.bootloader.file=zephyr-{build.variant}.bin
portentac33.bootloader.interface=0
portentac33.bootloader.address=0x10000
portentac33.bootloader.pid=0x0368
portentac33.bootloader.dfuse=

# the space before the extra arguments is important
portentac33.leave.dfuse={empty} -Q
portentac33.loader.args.with_sketch={empty} -w
portentac33.sketch.args.without_loader={empty} -w

##########################################################################################

opta.name=Arduino Opta
opta.build.core=arduino
opta.build.crossprefix=arm-zephyr-eabi-
opta.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

opta.menu.debug.false=Standard
opta.menu.debug.true=Debug
opta.menu.debug.true.build.zsk_args.debug=-debug

opta.menu.link_mode.dynamic=Dynamic
opta.menu.link_mode.static=Static
opta.menu.link_mode.static.build.link_mode=static
opta.menu.link_mode.static.upload.extension=bin-zsk.bin

opta.build.zephyr_target=arduino_opta//m7
opta.build.zephyr_args=
opta.build.zephyr_hals=hal_stm32 hal_infineon
opta.build.zephyr_toolchain=arm-zephyr-eabi
opta.build.artifact=zephyr_main
opta.build.variant=arduino_opta_stm32h747xx_m7

opta.build.extra_flags=
opta.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
opta.build.board=OPTA
opta.upload_port.0.vid=0x2341
opta.upload_port.0.pid=0x0664

opta.upload.tool=dfu-util
opta.upload.tool.default=dfu-util
opta.upload.protocol=
opta.upload.transport=
opta.upload.interface=0
opta.upload.use_1200bps_touch=true
opta.upload.wait_for_upload_port=true
opta.upload.native_usb=true

opta.bootloader.tool=dfu-util
opta.bootloader.tool.default=dfu-util
opta.bootloader.pid=0x0364
opta.bootloader.interface=0
opta.bootloader.file=zephyr-{build.variant}.bin
opta.bootloader.address=0x08040000

opta.debug.tool=gdb
opta.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
opta.debug.server.openocd.scripts.1={programmer.transport_script}
opta.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
opta.debug.cortex-debug.custom.request=attach
opta.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##########################################################################################

nano_matter.name=Arduino Nano Matter
nano_matter.build.core=arduino
nano_matter.build.crossprefix=arm-zephyr-eabi-
nano_matter.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nano_matter.menu.link_mode.dynamic=Dynamic
nano_matter.menu.link_mode.static=Static
nano_matter.menu.link_mode.static.build.link_mode=static
nano_matter.menu.link_mode.static.upload.extension=bin-zsk.bin

nano_matter.build.zephyr_target=arduino_nano_matter
nano_matter.build.zephyr_args=
nano_matter.build.zephyr_hals=hal_silabs
nano_matter.build.zephyr_toolchain=arm-zephyr-eabi
nano_matter.build.artifact=zephyr_main
nano_matter.build.variant=arduino_nano_matter_mgm240sd22vna

nano_matter.openocd_cfg=flash_sketch.cfg
nano_matter.build.extra_flags=
nano_matter.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano_matter.build.board=ARDUINO_NANO_MATTER
nano_matter.upload_port.0.vid=0x2341
nano_matter.upload_port.0.pid=0x0072

