Infineon/ArduinoCore-zephyr/boards.txt
nano_matter.upload.tool=openocd
nano_matter.upload.tool.default=openocd
nano_matter.upload.config=-f target/efm32s2_g23.cfg
nano_matter.upload.programmer=-f interface/cmsis-dap.cfg
nano_matter.upload.protocol=SWD
nano_matter.upload.setup_command=
nano_matter.upload.use_1200bps_touch=false
nano_matter.upload.wait_for_upload_port=false
nano_matter.upload.native_usb=false

nano_matter.bootloader.tool=openocd
nano_matter.bootloader.tool.default=openocd
nano_matter.bootloader.file=zephyr-{build.variant}.hex
nano_matter.bootloader.target=arduino_nano_matter

nano_matter.debug.server=openocd
nano_matter.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
nano_matter.debug.server.openocd.scripts.1=target/efm32s2_g23.cfg
nano_matter.debug.cortex-debug.custom.postAttachCommands.0=monitor reset halt
#nano_matter.debug.cortex-debug.custom.postAttachCommands.1=monitor reset_config srst_nogate
#nano_matter.debug.cortex-debug.custom.postAttachCommands.2=monitor gdb_breakpoint_override hard
nano_matter.debug.cortex-debug.custom.postAttachCommands.3=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.postAttachCommands.4=c
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.2=c
nano_matter.debug.cortex-debug.custom.request=attach

##############################################################################################################

kit_psc3m5_evk.name=Infineon KIT_PSC3M5 EVK
kit_psc3m5_evk.build.core=arduino
kit_psc3m5_evk.build.crossprefix=arm-zephyr-eabi-
kit_psc3m5_evk.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

kit_psc3m5_evk.build.zephyr_target=kit_psc3m5_evk
kit_psc3m5_evk.build.zephyr_args=
kit_psc3m5_evk.build.zephyr_hals=hal_infineon
kit_psc3m5_evk.build.zephyr_toolchain=arm-zephyr-eabi
kit_psc3m5_evk.build.variant=kit_psc3m5_evk_psc3m5fds2afq1
kit_psc3m5_evk.build.artifact=zephyr_main

kit_psc3m5_evk.build.extra_flags=
kit_psc3m5_evk.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
kit_psc3m5_evk.build.board=KIT_PSC3M5_EVK

kit_psc3m5_evk.menu.debug.false=Standard
kit_psc3m5_evk.menu.debug.true=Debug
kit_psc3m5_evk.menu.debug.true.build.zsk_args.debug=-debug

kit_psc3m5_evk.menu.link_mode.dynamic=Dynamic
kit_psc3m5_evk.menu.link_mode.static=Static
kit_psc3m5_evk.menu.link_mode.static.build.link_mode=static
kit_psc3m5_evk.menu.link_mode.static.upload.extension=bin-zsk.bin

kit_psc3m5_evk.openocd_cfg=flash_sketch.cfg

kit_psc3m5_evk.upload.tool=openocd
kit_psc3m5_evk.upload.tool.default=openocd
kit_psc3m5_evk.upload.protocol=
kit_psc3m5_evk.upload.config=-f target/infineon/psc3.cfg
kit_psc3m5_evk.upload.programmer=-f interface/cmsis-dap.cfg
kit_psc3m5_evk.upload.use_1200bps_touch=false
kit_psc3m5_evk.upload.wait_for_upload_port=false
kit_psc3m5_evk.upload.native_usb=false

kit_psc3m5_evk.bootloader.tool=openocd
kit_psc3m5_evk.bootloader.tool.default=openocd
kit_psc3m5_evk.bootloader.file=../firmwares/zephyr-{build.variant}.hex
kit_psc3m5_evk.bootloader.target=psc3.cm33

##############################################################################################################

##############################################################################################################

nano_connect.name=Arduino Nano RP2040 Connect
nano_connect.build.core=arduino
nano_connect.build.crossprefix=arm-zephyr-eabi-
nano_connect.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nano_connect.menu.debug.false=Standard
nano_connect.menu.debug.true=Debug
nano_connect.menu.debug.true.build.zsk_args.debug=-debug

nano_connect.menu.link_mode.dynamic=Dynamic
nano_connect.menu.link_mode.static=Static
nano_connect.menu.link_mode.static.build.link_mode=static
nano_connect.menu.link_mode.static.upload.extension=bin-zsk.bin

nano_connect.build.zephyr_target=arduino_nano_connect
nano_connect.build.zephyr_args=
nano_connect.build.zephyr_hals=hal_rpi_pico
nano_connect.build.zephyr_toolchain=arm-zephyr-eabi
nano_connect.build.artifact=zephyr_main
nano_connect.build.variant=arduino_nano_connect_rp2040

nano_connect.build.extra_flags=
nano_connect.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano_connect.recipe.hooks.objcopy.postobjcopy.3.pattern="{runtime.tools.bin2uf2.path}/bin2uf2" {upload.address} {upload.familyid} "{build.path}/{build.project_name}.{upload.extension}" "{build.path}/{build.project_name}.{upload.extension}.uf2"
nano_connect.upload.artifacts.sketch={build.path}/{build.project_name}.{upload.extension}.uf2
nano_connect.build.board=NANO_RP2040_CONNECT
nano_connect.upload_port.0.vid=0x2341
nano_connect.upload_port.0.pid=0x065E

nano_connect.upload.tool=picotool
nano_connect.upload.tool.default=picotool
nano_connect.upload.protocol=
nano_connect.upload.transport=
nano_connect.upload.use_1200bps_touch=true
nano_connect.upload.wait_for_upload_port=false
nano_connect.upload.native_usb=true

nano_connect.upload.familyid=0xe48bff56

nano_connect.bootloader.tool=picotool
nano_connect.bootloader.tool.default=picotool
nano_connect.bootloader.file=zephyr-{build.variant}.uf2

nano_connect.debug.tool=gdb
nano_connect.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nano_connect.debug.server.openocd.scripts.1={programmer.transport_script}
nano_connect.debug.server.openocd.scripts.2=target/rp2040-core0.cfg
nano_connect.debug.cortex-debug.custom.request=attach
nano_connect.debug.svd_file={runtime.platform.path}/svd/rp2040.svd

##############################################################################################################

#########################################################################################
#
# AUTO GENERATED FILE - DO NOT EDIT
# This file is manipulated by extra/build.sh; manual changes may be overwritten.
#
#########################################################################################

kit_psc3m5_evk.upload.address=0x22010000
kit_psc3m5_evk.upload.maximum_size=57344
kit_psc3m5_evk.upload.maximum_data_size=8192
kit_psc3m5_evk.build.architecture=cortex-m33
kit_psc3m5_evk.build.mcu=cortex-m33
